# Coding Homework 2: [put your name here]

At the time it departed from England in April 1912, the RMS Titanic was the largest ship in the world. In the night of April 14th to April 15th, the Titanic struck an iceberg and sank approximately 600km south of Newfoundland (a province in eastern Canada). Many people perished in this accident. Data about the passengers who were on board the Titanic at the time of the accident is available in the "titanic.csv" file.

> TAs will mark this assignment by checking ***MarkUs*** autotests; and, by manually review the written responses to questions `Q7`, `Q8`, `Q10`, and `Q11`.

In [100]:
# Import/Load Put the "titanic.csv" data

In [ ]:
import pandas as pd
d = pd.read_csv("titanic.csv")

### Q0: How many missing data values are there in the `Age` column
> Hint: Remember `.isnull().sum()`?

In [ ]:
d.isnull().sum()

In [ ]:
# Q0: your answer will be tested!
Q0 = None # Assign an integer value to Q0
# E.g., Q0 = 1

In [ ]:
# test_Q0
assert Q0==3, "Try d.isnull().sum()"

In [ ]:
# Since many of their values are missing or unclear, 
# modify the `titanic` data frame by removing the following variables: 
# `Ticket_No`, `Boat_or_Body`, `Class_Dept`, `Class_Full`.

# Hint 1: https://letmegooglethat.com/?q=how+to+remove+columns+from+a+pandas+data+frame  
# Hint 2: ` is different than "
# Hint 3: use `inplace=True`

In [18]:
d.drop(["Ticket_No", "Boat_or_Body", "Class_Dept", "Class_Full"], axis=1, inplace=True)

### Q1: What is the dimension of the titantic data set after removing the four columns above?
> Hint: Remember the `.shape` attribute?

In [10]:
# Q1: your answer will be tested!
Q1 = (None,None) # Assign a `tuple` of two integers to Q1
# e.g., (1,2) for 1 row and 2 columns

In [12]:
# test_Q1
assert Q1 == (2208, 10), "Did you use `inplace=True`?"

AssertionError: Should be (2208, 10).
Did you use `inplace=True`?

- The variable `Adut_or_Chld` indicates which passengers were adults and which were children. Change the name of this variable to `Adult_or_Child`. 
- `MWC` is a little more specific, recording whether the passenger was a man, woman or child. To make this variable name clearer, change the name of `MWC` to `Man_Woman_or_Child`.

In [ ]:
# Hint 1: https://letmegooglethat.com/?q=how+to+rename+pandas+columns
# Hint 2: use `inplace=True`

In [33]:
d.rename(columns={'Adut_or_Chld':'Adult_or_Child', 'MWC':'Man_Woman_or_Child'}, inplace=True)

### Q2 What is the data type of the following object?

```python
{'Adut_or_Chld':'Adult_or_Child', 'MWC':'Man_Woman_or_Child'}
```

A. `dict`  
B. `list`  
C. `tuple`  
D. `str`

In [ ]:
# Q2: your answer will be tested!
Q2 = None # Assign either 'A' or 'B' or 'C' or 'D' to `Q2` instead of `None`
# E.g., Q1 = 'A'

In [ ]:
hint = "Use the `type()` function on it! Or..."
hint += "https://letmegooglethat.com/?q=python+dictionary"

In [ ]:
# test_Q2
assert Q2=='A', hint

### Q3: How many passengers were there on the Titanic (`n`) and how many survied (`n_surv`), and what was the survival percentage (`prop_surv`)?
> Hint 1: Remember "coercion" with `True` and `False` data types?  
> Hint 2: `titanic_data.Age.sum()`

In [63]:
# Q3: your answer will be tested!
n = None # number of passengers on the the titanic
n_surv = None # number of the passengers survived
prop_surv = n_surv/n # proportion of passengers that survived
Q3 = (n, n_surv,prop_surv) # Assign a `tuple` of three numeric values to Q3

TypeError: unsupported operand type(s) for /: 'NoneType' and 'NoneType'

In [42]:
d.shape, (d.Survived!='Dead').sum()

In [43]:
# test_Q3
assert Q3 == (2208, 712, 712/2208), "Try `titanic_data.shape` and `(titanic_data.Survived!='Dead').sum()`"

AssertionError: Answer if (712, 712/2208).
Try `titanic_data.shape` and `(titanic_data.Survived!='Dead').sum()`

### Q4: What were the proportion of deaths for men, women, and children, respectively?
> Hint 1: Start with `(d.Survived=='Alive')`  
> Hint 2: A proportion is a `.mean()` of $0$'s and $1$'s  
> Hint 3: Remember "coercion" with `True` and `False` data types?  
> Hint 4: Use `.groupby(titanic_data.Man_Woman_or_Child)`

In [46]:
# Q4: your answer will be tested!
prop_surv_men = None 
prop_surv_women = None 
prop_surv_children= None 
Q4 = (prop_surv_men, prop_surv_women, prop_surv_children) # Assign a `tuple` of three `float`s to Q3
# provide 3 decimal places rounding up

In [58]:
(d.Survived!='Alive').groupby(d.Man_Woman_or_Child).mean()

Man_Woman_or_Child
Child    0.483871
Man      0.805690
Woman    0.243056
Name: Survived, dtype: float64

In [59]:
# test_Q4
assert Q4 == (0.806, .243, 0.484), "Try `(d.Survived!='Alive').groupby(d.Man_Woman_or_Child).mean()`"

AssertionError: Try `(d.Survived!='Alive').groupby(d.Man_Woman_or_Child).mean()`

### Q5: What was the proportion of deaths for passengers between 25-40 years of age?
> Hint: Assume "between" is inclusive so that you use `>=` and `<=`.

In [48]:
# Q5: your answer will be tested!
Q5 = None # Assign a `float` numeric value to Q5
# provide 3 decimal places rounding up

In [52]:
# test_Q5
assert Q5 == 0.692, "Try `(d[(d.Age>=25)&(d.Age<=40)].Survived=='Dead').mean()`"

AssertionError: Try `(d[(d.Age>=25)&(d.Age<=40)].Survived=='Dead').mean()`

### Q6: What was the proportion of deaths for men, women, and children among passengers who paid more than 50 British pounds for their tickets?

> Hint: "more than" here is strict so use `>`; and, assume the `Paid` column is in British pounds.

In [64]:
# Q6: your answer will be tested!
prop_surv_men_richtix = None
prop_surv_women_richtix = None
prop_surv_children_richtix = None
Q6 = (prop_surv_men_richtix, prop_surv_women_richtix, prop_surv_children_richtix) # Assign a `tuple` of three `float`s to Q3
# provide 3 decimal places rounding up

In [65]:
(d.Survived[d.Paid>50]=="Dead").groupby(d.Man_Woman_or_Child).mean()

Man_Woman_or_Child
Child    0.538462
Man      0.700000
Woman    0.031746
Name: Survived, dtype: float64

In [66]:
# test_Q6
assert Q6 == (0.700, .032, 0.539), 'Try `(d.Survived[d.Paid>50]=="Dead").groupby(d.Man_Woman_or_Child).mean()`'

AssertionError: Try `(d.Survived[d.Paid>50]=="Dead").groupby(d.Man_Woman_or_Child).mean()`

### Q7: Write several sentences interpreting your results for the previous questions.
Provide your written answer in the markdown cell below.
- This will be manually reviewed.

> Answer here...

### Q8: What was the most common job among passengers of the Titanic? 

A. General Labourer  
B. Fireman  
C. Trimmer  
D. Saloon Steward

Write 1-2 sentences explaining the code used to produce your answer in the markdown cell below.
- This will be reviewed manually. 

> Hint 1: the `groupby`, `.size()`, or  and `sort_values()` function would be helpful...  
> Hint 2: or the `value_counts()` would be helpful...  
> Hint 3: https://letmegooglethat.com/?q=how+do+I+sort+a+pandas+data+frame+by+a+column

> Answer here...

In [76]:
d.groupby('Job').size().sort_values()# d.Job.value_counts()
hint = "Try `d.groupby('Job').size().sort_values()` or `d.Job.value_counts()`"

In [77]:
# Q8: your answer will be tested!
Q8 = None # Assign either 'A' or 'B' or 'C' or 'D' to `Q2` instead of `None`
# E.g., Q1 = 'A'

In [79]:
# test_Q8
assert Q8=='A', hint

AssertionError: Try `d.groupby('Job').size().sort_values()` or `d.Job.value_counts()`

### Q9: Were any of the general labourers on the titanic women? If so, how many?

In [83]:
# Q9: your answer will be tested!
Q9 = None # Assign an integer value to Q9
# E.g., Q9 = 1

In [84]:
# test_Q9
assert Q9==1, "Try d[(d.Job=='General Labourer')&(d.Man_Woman_or_Child=='Woman')]"

AssertionError: Try d[(d.Job=='General Labourer')&(d.Man_Woman_or_Child=='Woman')]

### Q10: What are the names of the passengers with the top 4 most expensive tickets? Did these passengers survive the accident?

Output a table with four rows for this question.
- This will be reviewed manually.

> Hint: use `.head(4)`

In [90]:
d.sort_values('Paid', ascending=False).head(4)

,Name,Survived,Boarded,Class,Man_Woman_or_Child,Age,Adult_or_Child,Sex,Paid,Job
1176,"LESUEUR, Mr Gustave J.",Alive,Cherbourg,1,Man,35.0,Adult,Male,512.329167,Servant
334,"CARDEZA, Mrs Charlotte Wardle",Alive,Cherbourg,1,Woman,58.0,Adult,Female,512.329167,NaN
333,"CARDEZA, Mr Thomas Drake Martinez",Alive,Cherbourg,1,Man,36.0,Adult,Male,512.329167,Gentleman
2077,"WARD, Miss Annie Moore",Alive,Cherbourg,1,Woman,35.0,Adult,Female,512.329167,Personal Maid

### Q11: Write a couple paragraphs paraphrasing the output of the code in the cell below.

Don't spend more than 15 minutes on this.
- This will be reviewed manually.


> Hints:
> - `mean` is the "average"
> - `std` stands for "standard deviation" and measures the spead of the data
> - `min` and `max` are the smallest and largest values, respectively
> - The percentages are "percentiles"; so, e.g., the 50th percentile is the "median"

In [98]:
d.groupby('Man_Woman_or_Child').describe()

                       Age                                                 \
                     count       mean        std    min   25%   50%   75%
Man_Woman_or_Child
Child                124.0   6.184597   4.297938   0.08   2.0   5.5   9.0
Man                 1649.0  31.482717  10.373889  15.00  24.0  30.0  38.0
Woman                432.0  31.925926  11.882998  15.00  22.0  29.5  40.0

                           Paid                                             \
                     max  count       mean        std       min        25%
Man_Woman_or_Child
Child               14.0  123.0  33.204274  33.436297  3.170833  15.900000
Man                 74.0  786.0  24.862749  42.493309  0.000000   7.805208
Woman               64.0  409.0  48.609887  67.216995  0.000000   9.587500


                          50%    75%         max
Man_Woman_or_Child
Child               25.466667  32.75  262.375000
Man                 10.335417  26.25  512.329167
Woman               21.075000  59.40  512.329167

> Answer here...

# Tutorial Preparation

Your ***Tutorial Assignment*** this week is the following:

> Use "boolean indexing" and the `.sum()` and other "aggregation functions" along with `.groupby()` to provide some interesting tidbits about the `oly12countries.csv` data. As you report your various findings, additionally paraphrase the coding that produced each result. 
> - Do not include any code in your written submission.
> - Include your code as a `.ipynb` notebook along with your written submission.
>    - Annotate your notebook with comments where it's helpful for understanding what you're doing.

***You will not have enough time to fully complete this assignment in tutorial; so, you may want to get started early, especially now while you have some coding ideas fresh in your mind.***

In [104]:
pd.read_csv('oly12countries.csv')

,Country,ISO,GDP.2011,pop.2010,athletes_f,athletes_m,athletes_total,gold,silver,bronze
0,Afghanistan,AFG,"20,343,461,030.00","34,385,000",1.0,5,6,0,0,1
1,Albania,ALB,"12,959,563,902.00","3,205,000",4.0,7,11,0,0,0
2,Algeria,DZA,"188,681,000,000.00","35,468,000",18.0,21,39,1,0,0
3,American Samoa,ASM,"537,000,000.00","68,420",1.0,4,5,0,0,0
4,Andorra,AND,"3,491,000,000.00","84,864",2.0,4,6,0,0,0
...,...,...,...,...,...,...,...,...,...,...
199,Vietnam,VNM,"123,961,000,000.00","86,928,000",12.0,6,18,0,0,0
200,Virgin Islands,VIR,"1,577,000,000.00","110,000",3.0,4,7,0,0,0
201,Yemen,YEM,"33,757,503,322.00","24,053,000",1.0,3,4,0,0,0
202,Zambia,ZMB,"19,206,011,889.00","12,927,000",2.0,5,7,0,0,0
203,Zimbabwe,ZWE,"9,900,000,000.00","12,571,000",3.0,4,7,0,0,0